In [3]:
import pandas as pd 
s1 = pd.Series([1, 2, 3, 4, 5])  
print("s1:", s1)

s1: 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
S2 = pd.Series(range(1, 6), index=['a', 'b', 'c', 'd', 'e'])
print("S2:", S2)

S2: a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
import numpy as np
n_arr = pd.Series(np.array([1.1, 2.2, 3.3]))
print("n_arr:", n_arr)

n_arr: 0    1.1
1    2.2
2    3.3
dtype: float64

In [9]:
S3 = pd.Series({'a': 10, 'b': 20, 'c': 30})
print("S3:", S3)

S3: a    10
b    20
c    30
dtype: int64

In [12]:
s = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
print("First element:", s[0])                
print("Last element:", s[-1])                
print("Slice [1:3]:", s[1:3])

First element: 10
Last element: 50
Slice [1:3]: b    20
c    30
dtype: int64

C:\Users\DELL\AppData\Local\Temp\ipykernel_16172\573160466.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print("First element:", s[0])
C:\Users\DELL\AppData\Local\Temp\ipykernel_16172\573160466.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print("Last element:", s[-1])

In [13]:
s = pd.Series([1, 2, 3, 4, 5, None, 7])          
print("Sum:", s.sum())                           
print("Mean:", s.mean())                         
print("Median:", s.median())                     
print("Std:", s.std())                           
print("Variance:", s.var())                      
print("Min:", s.min(), "Max:", s.max())          
print("Count (non-NaN):", s.count())             
print("Skewness:", s.skew())                     
print("Kurtosis:", s.kurtosis())

Sum: 22.0
Mean: 3.6666666666666665
Median: 3.5
Std: 2.160246899469287
Variance: 4.666666666666667
Min: 1.0 Max: 7.0
Count (non-NaN): 6
Skewness: 0.46291004988627604
Kurtosis: -0.2999999999999998

In [14]:
s = pd.Series([1, 2, 3, 4, 5, None, 7])
print("25th percentile:", s.quantile(0.25))     
print("50th percentile:", s.quantile(0.5))      
print("75th percentile:", s.quantile(0.75))     
print("Describe:\n", s.describe())

25th percentile: 2.25
50th percentile: 3.5
75th percentile: 4.75
Describe:
 count    6.000000
mean     3.666667
std      2.160247
min      1.000000
25%      2.250000
50%      3.500000
75%      4.750000
max      7.000000
dtype: float64

In [15]:
s_neg = pd.Series([-1, 2, -3, 4])                
print("Absolute values:\n", s_neg.abs())

Absolute values:
 0    1
1    2
2    3
3    4
dtype: int64

In [16]:
data = [["A", 21], ["B", 22], ["C", 23]]
df = pd.DataFrame(data, columns=["Name", "Age"]) 
print(df)

  Name  Age
0    A   21
1    B   22
2    C   23

In [17]:
arr = np.array([[1, 2], [3, 4]])
df = pd.DataFrame(arr, columns=["Feature1", "Feature2"])
print(df)

   Feature1  Feature2
0         1         2
1         3         4

In [18]:
data = {
    "Name": ["A", "B", "C"],
    "Age": [21, 22, 23]
}
df = pd.DataFrame(data) 
print(df)

  Name  Age
0    A   21
1    B   22
2    C   23

In [19]:
s = pd.Series([10, 20, 30], name="Marks")
df = pd.DataFrame(s)

In [ ]:
df = pd.read_csv("dataset_name.csv")
print(df.head())

In [ ]:
df = pd.read_excel("dataset_name.xlsx")
print(df.head())

In [ ]:
df = pd.read_json("dataset_name.json")
print(df.head())

In [ ]:
import sqlite3
conn = sqlite3.connect("database.db")
df = pd.read_sql("SELECT * FROM students", conn)
print(df.head())

In [ ]:
df.to_csv("output_name.csv", index=False)

In [ ]:
df.to_excel("output_name.xlsx", index=False)

In [ ]:
import pickle

with open("model.pkl", "rb") as file:
    model = pickle.load(file)

In [ ]:
from tensorflow.keras.models import load_model

model = load_model("model.h5")

In [ ]:
from tensorflow.keras.models import load_model

model = load_model("saved_model_directory")

In [ ]:
df = pd.read_csv("data.txt", header=None)

# Data Inspection & Understanding

In [21]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "Aman", "Sonu"],
    "Age": [25, 30, 35, 25, 30],
    "Salary": [50000, 60000, 70000, 50000, 60000],
    "Department": ["IT", "HR", "IT", "IT", "HR"]
}
df = pd.DataFrame(data)

In [22]:
print(df.head(2))

    Name  Age  Salary Department
0  Alice   25   50000         IT
1    Bob   30   60000         HR

In [23]:
print(df.tail(2))

   Name  Age  Salary Department
3  Aman   25   50000         IT
4  Sonu   30   60000         HR

In [24]:
print(df.shape)

(5, 4)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         5 non-null      int64
 2   Salary      5 non-null      int64
 3   Department  5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [26]:
print(df.describe())

           Age        Salary
count   5.0000      5.000000
mean   29.0000  58000.000000
std     4.1833   8366.600265
min    25.0000  50000.000000
25%    25.0000  50000.000000
50%    30.0000  60000.000000
75%    30.0000  60000.000000
max    35.0000  70000.000000

In [27]:
df["Department"].value_counts()

Department
IT    3
HR    2
Name: count, dtype: int64

In [28]:
print(df.columns)

Index(['Name', 'Age', 'Salary', 'Department'], dtype='object')

In [29]:
name_row0 = df.loc[0, "Name"]
print("\nValue at row 0, column 'Name':", name_row0)

subset = df.loc[0:2, ["Name", "Salary"]]
print("\nSubset using loc:\n", subset)

Value at row 0, column 'Name': Alice

Subset using loc:
       Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000

In [30]:
val = df.iloc[1, 2]
print("\nValue at 2nd row, 3rd column:", val)

subset = df.iloc[0:3, 0:2]
print("\nSubset using iloc:\n", subset)

Value at 2nd row, 3rd column: 60000

Subset using iloc:
       Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [31]:
salary_first = df.at[0, "Salary"]
print("\nSalary of first row using at:", salary_first)

salary_second = df.iat[1, 2]
print("Salary of 2nd row using iat:", salary_second)

Salary of first row using at: 50000
Salary of 2nd row using iat: 60000

In [32]:
names = df["Name"]
print("\nSingle column 'Name':\n", names)

subset = df[["Name", "Salary"]]
print("\nMultiple columns 'Name' and 'Salary':\n", subset)

Single column 'Name':
 0      Alice
1        Bob
2    Charlie
3       Aman
4       Sonu
Name: Name, dtype: object

Multiple columns 'Name' and 'Salary':
       Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000
3     Aman   50000
4     Sonu   60000

# Handling Missing Data

In [34]:
record = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", None],
    "Age": [25, 30, None, 40, 35],
    "Salary": [50000, None, 70000, None, 60000],
    "Department": ["IT", "HR", None, "Finance", "IT"]
})
print(df)

      Name  Age  Salary Department
0    Alice   25   50000         IT
1      Bob   30   60000         HR
2  Charlie   35   70000         IT
3     Aman   25   50000         IT
4     Sonu   30   60000         HR

In [35]:
record.isnull()

    Name    Age  Salary  Department
0  False  False   False       False
1  False  False    True       False
2  False   True   False        True
3  False  False    True       False
4   True  False   False       False

In [36]:
record.notnull()

    Name    Age  Salary  Department
0   True   True    True        True
1   True   True   False        True
2   True  False    True       False
3   True   True   False        True
4  False   True    True        True

In [37]:
record.dropna()

    Name   Age   Salary Department
0  Alice  25.0  50000.0         IT

In [38]:
record.fillna(0)

      Name   Age   Salary Department
0    Alice  25.0  50000.0         IT
1      Bob  30.0      0.0         HR
2  Charlie   0.0  70000.0          0
3    David  40.0      0.0    Finance
4        0  35.0  60000.0         IT

In [39]:
record["Salary"] = record["Salary"].interpolate()
record

      Name   Age   Salary Department
0    Alice  25.0  50000.0         IT
1      Bob  30.0  60000.0         HR
2  Charlie   NaN  70000.0       None
3    David  40.0  65000.0    Finance
4     None  35.0  60000.0         IT

In [40]:
record["Age"] = record["Age"].fillna(record["Age"].mean())
record

      Name   Age   Salary Department
0    Alice  25.0  50000.0         IT
1      Bob  30.0  60000.0         HR
2  Charlie  32.5  70000.0       None
3    David  40.0  65000.0    Finance
4     None  35.0  60000.0         IT

In [41]:
record["Salary"] = record["Salary"].fillna(record["Salary"].median())
record

      Name   Age   Salary Department
0    Alice  25.0  50000.0         IT
1      Bob  30.0  60000.0         HR
2  Charlie  32.5  70000.0       None
3    David  40.0  65000.0    Finance
4     None  35.0  60000.0         IT

In [42]:
record["Department"].fillna(record["Department"].mode()[0])
record

      Name   Age   Salary Department
0    Alice  25.0  50000.0         IT
1      Bob  30.0  60000.0         HR
2  Charlie  32.5  70000.0       None
3    David  40.0  65000.0    Finance
4     None  35.0  60000.0         IT